In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "Name": ['Harry', 'Rohan', 'Skillf', 'Shubh'],
    "Marks": [90, 80, 87, 78],
    "City": ['NYC', 'LA', 'NV', 'Chicago']
}

In [3]:
df = pd.DataFrame(dict1)
print(df)

     Name  Marks     City
0   Harry     90      NYC
1   Rohan     80       LA
2  Skillf     87       NV
3   Shubh     78  Chicago

In [4]:
df.to_csv('friends.csv')

In [5]:
df.to_csv('friends_indexFalse.csv', index = False)

In [6]:
df.describe()

           Marks
count   4.000000
mean   83.750000
std     5.678908
min    78.000000
25%    79.500000
50%    83.500000
75%    87.750000
max    90.000000

In [7]:
harry = pd.read_csv('harry.csv')

In [8]:
harry

   Train No.  Speed     City
0        234     90      NYC
1        453     80       LA
2        567     87       NV
3        226     78  Chicago

In [9]:
harry['Speed'][0] = 50 #Changing the value

C:\Users\radia\AppData\Local\Temp\ipykernel_7704\805298609.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['Speed'][0] = 50

In [10]:
harry

   Train No.  Speed     City
0        234     50      NYC
1        453     80       LA
2        567     87       NV
3        226     78  Chicago

In [14]:
harry.index = ['first', 'second', 'third', 'fourth']

In [15]:
harry

        Train No.  Speed     City
first         234     50      NYC
second        453     80       LA
third         567     87       NV
fourth        226     78  Chicago

In [18]:
ser = pd.Series(np.random.rand(34))

In [19]:
ser

0     0.913357
1     0.115897
2     0.965545
3     0.359130
4     0.484466
5     0.441979
6     0.305654
7     0.174516
8     0.156384
9     0.987814
10    0.684805
11    0.364756
12    0.897894
13    0.487178
14    0.951926
15    0.497743
16    0.029445
17    0.196182
18    0.445873
19    0.048498
20    0.019761
21    0.434762
22    0.303966
23    0.158994
24    0.123053
25    0.576128
26    0.050052
27    0.776171
28    0.299037
29    0.928026
30    0.319520
31    0.049996
32    0.796650
33    0.930549
dtype: float64

In [20]:
type(ser)

pandas.core.series.Series

In [21]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [22]:
newdf

            0         1         2         3         4
0    0.562937  0.985502  0.960869  0.785298  0.303772
1    0.322223  0.987531  0.466512  0.727997  0.376783
2    0.342360  0.330434  0.914029  0.292106  0.858321
3    0.868118  0.012459  0.061197  0.664781  0.765334
4    0.526704  0.539385  0.342201  0.538112  0.982671
..        ...       ...       ...       ...       ...
329  0.133253  0.255163  0.924363  0.386465  0.425541
330  0.706032  0.219213  0.429069  0.072354  0.425575
331  0.247131  0.732504  0.150240  0.499168  0.255064
332  0.560234  0.854469  0.413583  0.248784  0.156416
333  0.798771  0.622717  0.155903  0.387558  0.822150

[334 rows x 5 columns]

In [23]:
type(newdf)

pandas.core.frame.DataFrame

In [24]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.502254    0.519417    0.493151    0.521917    0.504724
std      0.286254    0.284613    0.285145    0.276494    0.303260
min      0.007856    0.002951    0.003438    0.004533    0.000573
25%      0.253480    0.261470    0.251144    0.287256    0.244499
50%      0.511629    0.532667    0.501618    0.531645    0.494811
75%      0.742096    0.745220    0.722231    0.749475    0.792571
max      0.998763    0.997806    0.998916    0.994431    0.998552